In [1]:
import pandas as pd

**Q1**

In [2]:
df = [4,8,15,16,23,42]

In [3]:
pd.Series(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

**Q2**

In [4]:
df1 = [1,2,3,4,5,6,7,8,9,10]

In [5]:
pd.Series(df1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

**Q3**

In [8]:
data = {'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']}

In [9]:
df2 = pd.DataFrame(data)

In [12]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

**Q4**

_Series vs DataFrames_

A Series only has one data column, whereas a single-column DataFrame contains both a data column and an index.

In [14]:
df2['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [15]:
type(df2['Name'])

pandas.core.series.Series

In [16]:
df2.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [17]:
df2[['Name', 'Age']]

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [18]:
type(df2[['Name', 'Age']])

pandas.core.frame.DataFrame

**Q5**

head, tail, etc

In [19]:
df2.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [20]:
df2.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [21]:
df2.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [22]:
df2.tail(1)

     Name  Age  Gender
2  Claire   27  Female

**Q6**

All pandas data structures are mutable except Series.

**Q7**

In [23]:
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000